Repository: srivasta/debian.packaging.make
Catalog: po/*.po
Languages: uk

source: attempt to use unsupported feature: `%s'
uk: спроба вжити можлив╕сть, яка не п╕дтриму╓ться: "%s"

source: touch archive member is not available on VMS
uk: оновлення часу зм╕ни члена арх╕ву неможливо у систем╕ VMS

source: touch: Archive `%s' does not exist
uk: оновлення часу зм╕ни: Арх╕в "%s" не ╕сну╓

source: touch: `%s' is not a valid archive
uk: оновлення часу зм╕ни: Нев╕рний арх╕в: "%s"

source: touch: Member `%s' does not exist in `%s'
uk: оновлення часу зм╕ни: Член "%s" не м╕ститься у "%s"

source: touch: Bad return code from ar_member_touch on `%s'
uk: оновлення часу зм╕ни: Функц╕я ar_member_touch повернула поганий код в╕дпов╕д╕ для "%s"

source: (name might be truncated)
uk: (╕м'я може бути ус╕чене)

source: Date %s
uk: Дата %s

source: *** [%s] Deleting file `%s'
uk: *** [%s] Видалення файлу "%s"

source: *** Deleting file `%s'
uk: *** Видалення файлу "%s"

source: # commands to execute
uk: # команди до виконання

source: (built-in):
uk: (вбудоване):

source: (from `%s', line %lu):
uk: (з "%s", рядок %lu):

source: # Directories
uk: # Каталоги

source: # %s: could not be stat'd.
uk: # %s: неможливо отримати ╕нформац╕ю (stat).

source: # %s (device %d, inode [%d,%d,%d]): could not be opened.
uk: # %s (пристр╕й %d, ╕вузол [%d,%d,%d]): неможливо в╕дкрити.

source: # %s (key %s, mtime %d):
uk: # %s (ключ %s, час модиф╕кац╕╖ %d):

source: No
uk: Н╕

source: files,
uk: файл╕в,

source: no
uk: н╕

source: impossibilities
uk: недосяжних ц╕лей

source: so far.
uk: на поточний момент.

source: impossibilities in %lu directories.
uk: недосяжних ц╕лей у %lu каталогах.

source: Recursive variable `%s' references itself (eventually)
uk: Рекурсивна зм╕нна "%s" посила╓ться сама на себе (у результат╕)

source: unterminated variable reference
uk: незавершена посилання на зм╕нну

source: Commands for file `%s' were found by implicit rule search,
uk: Команди для файлу "%s" були знайден╕ з неявного правила,

source: but `%s' is now considered the same file as `%s'.
uk: але "%s" ╕ "%s" тепер вважаються одним ╕ тим же ж файлом.

source: Commands for `%s' will be ignored in favor of those for `%s'.
uk: Команди для "%s" ╕гнорован╕, будуть використан╕ команди для "%s".

source: can't rename single-colon `%s' to double-colon `%s'
uk: неможливо перейменувати "%s" з одн╕╓ю двокрапкою у "%s" з двома двокрапками

source: can't rename double-colon `%s' to single-colon `%s'
uk: неможливо перейменувати "%s" з двома двокрапками у "%s" з одн╕╓ю двокрапкою

source: *** Deleting intermediate file `%s'
uk: *** Видалення пром╕жного файлу "%s"

source: Removing intermediate files...
uk: Видаляю пром╕жн╕ файли...

source: # Not a target:
uk: # Не ╓ метою:

source: # Command-line target.
uk: # Ц╕ль командного рядка.

source: # A default or MAKEFILES makefile.
uk: # Makefile за замовчуванням або з MAKEFILES.

source: # Implicit/static pattern stem: `%s'
uk: # Основа неявного або статичного шаблону: "%s"

source: # Also makes:
uk: # Збира╓ також:

source: # Modification time never checked.
uk: # Час зм╕ни н╕коли не перев╕рявся.

source: # File does not exist.
uk: # Файл не ╕сну╓.

source: # File is very old.
uk: # Файл дуже старий.

source: # File has been updated.
uk: # Файл був оновлений.

source: # Commands currently running (THIS IS A BUG).
uk: # Запущен╕ зараз команди (ЦЕ ПОМИЛКА).

source: # Dependencies commands running (THIS IS A BUG).
uk: # Запущен╕ зараз команди деяко╖ залежност╕ (ЦЕ ПОМИЛКА).

source: # Successfully updated.
uk: # Усп╕шно оновлено.

source: # Needs to be updated (-q is set).
uk: # Повинно бути оновлено (встановлений ключ -q).

source: # Failed to be updated.
uk: # Спроба оновлення безусп╕шна.

source: # Invalid value in `update_status' member!
uk: # Нев╕рне значення члена "update_status"!

source: # Invalid value in `command_state' member!
uk: # Нев╕рне значення члена "command_state"!

source: # Files
uk: # Файли

source: non-numeric first argument to `word' function
uk: не числовий перший аргумент для функц╕╖ "word"

source: non-numeric first argument to `wordlist' function
uk: не числовий перший аргумент для функц╕╖ "wordlist"

source: non-numeric second argument to `wordlist' function
uk: не числовий другий аргумент для функц╕╖ "wordlist"

source: Unimplemented on this platform: function `%s'
uk: Не реал╕зовано на ц╕й платформ╕: функц╕я "%s"

source: unterminated call to function `%s': missing `%c'
uk: незавершений виклик функц╕╖ "%s"; пропущено "%c"

source: %s: option `%s' is ambiguous
uk: %s: параметр "%s" - неоднозначний

source: %s: option `--%s' doesn't allow an argument
uk: %s: параметр "--%s" не може мати аргумент╕в

source: %s: option `%c%s' doesn't allow an argument
uk: %s: параметр "%c%s" не може мати аргумент╕в

source: %s: option `%s' requires an argument
uk: %s: параметру "%s" необх╕дний аргумент

source: %s: unrecognized option `--%s'
uk: %s: не розп╕знаний параметр "--%s"

source: %s: unrecognized option `%c%s'
uk: %s: не розп╕знаний параметр "%c%s"

source: %s: illegal option -- %c
uk: %s: нев╕рний параметр -- %c

source: %s: invalid option -- %c
uk: %s: нев╕рний параметр -- %c

source: %s: option requires an argument -- %c
uk: %s: параметру необх╕дний аргумент -- %c

source: %s: option `-W %s' is ambiguous
uk: %s: параметр "-W %s" неоднозначний

source: %s: option `-W %s' doesn't allow an argument
uk: %s: параметр "-W %s" не може мати аргумент╕в

source: Looking for an implicit rule for `%s'.
uk: Пошук неявного правила для "%s".

source: Looking for archive-member implicit rule for `%s'.
uk: Пошук неявного правила для члена арх╕ву "%s".

source: Avoiding implicit rule recursion.
uk: Запоб╕гання рекурсивного виклику неявного правила.

source: Trying pattern rule with stem `%.*s'.
uk: Спроба застосування правила з╕ зразком, основа "%.*s".

source: Trying implicit prerequisite `%s'.
uk: Пробую неявн╕ залежност╕ "%s".

source: Trying rule prerequisite `%s'.
uk: Пробую залежн╕сть правило "%s".

source: Looking for a rule with intermediate file `%s'.
uk: Пошук правила з пром╕жним файлом "%s".

source: *** [%s] Error 0x%x (ignored)
uk: [%s] Помилка 0x%x (про╕гнорована)

source: *** [%s] Error 0x%x
uk: *** [%s] Помилка 0x%x

source: [%s] Error %d (ignored)
uk: [%s] Помилка %d (╕гнорована)

source: *** [%s] Error %d
uk: *** [%s] Помилка %d

source: (core dumped)
uk: (зроблений дамп пам'ят╕)

source: Syntax error, still inside '"'
uk: Синтаксична помилка, все ще всередин╕ '"'

source: *** Waiting for unfinished jobs....
uk: *** Оч╕кування завершення завдань...

source: Live child 0x%08lx (%s) PID %ld %s
uk: Незавершений нащадок 0x%08lx (%s) PID %ld %s

source: (remote)
uk: (в╕ддалений)

source: Cleaning up temp batch file %s
uk: Знищення тимчасового командного файлу %s

source: cannot enforce load limits on this operating system
uk: ця операц╕йна система не дозволя╓ встановлювати обмеження на завантаження

source: cannot enforce load limit:
uk: неможливо встановити обмеження на завантаження:

source: Unknown builtin command '%s'
uk: Нев╕дома вбудована команда "%s".

source: fopen (temporary file)
uk: fopen (тимчасовий файл)

source: Executing %s instead
uk: Зам╕сть заданого викону╓ться %s

source: Error spawning, %d
uk: Помилка породження процесу, %d

source: %s: Command not found
uk: %s: Команда не знайдена

source: %s: Shell program not found
uk: %s: Командний процесор не знайдений

source: $SHELL changed (was `%s', now `%s')
uk: $SHELL зм╕нено (було "%s", тепер "%s")

source: %s (line %d) Bad shell context (!unixy && !batch_mode_shell)
uk: %s (рядок %d) Поганий контекст оболник (!unixy && !batch_mode_shell)

source: Options:
uk: Ключ╕:

source: empty string invalid as file name
uk: порожн╕й рядок неприпустимий у якост╕ ╕мен╕ файлу

source: fwrite (temporary file)
uk: fwrite (тимчасовий файл)

source: Updating makefiles....
uk: Оновлення make-файл╕в...

source: Makefile `%s' might loop; not remaking it.
uk: Make-файл "%s", можливо, зациклений, в╕н не перезбиратиметься.

source: Failed to remake makefile `%s'.
uk: Спроба перез╕брати make-файл "%s" безусп╕шна.

source: Included makefile `%s' was not found.
uk: Make-файл "%s", який включа╓ться, не було знайдено.

source: Makefile `%s' was not found
uk: Make-файл "%s" не було знайдено

source: Couldn't change back to original directory.
uk: Неможливо перейти у перв╕сний каталог.

source: Re-executing:
uk: Повторне виконання:

source: No targets specified and no makefile found
uk: Не задан╕ ц╕л╕ ╕ не знайдений make-файл

source: No targets
uk: Нема ц╕лей

source: Updating goal targets....
uk: Оновлення ц╕лей мети...

source: Usage: %s [options] [target] ...
uk: Використання: %s [КЛЮЧ╤]... [Ц╤ЛЬ]...

source: Report bugs to <bug-make@gnu.org>
uk: Пов╕домлюйте про помилки до <bug-make@gnu.org>

source: the `-%c' option requires a positive integral argument
uk: ключ "-%c" повинен використовуватися з ц╕лим позитивним аргументом

source: # Make data base, printed on %s
uk: # База даних Make, надрукована %s

source: # Finished Make data base on %s
uk: # Друк бази даних Make завершено %s

source: %s: Entering an unknown directory
uk: %s: Вхожу у нев╕домий каталог

source: %s: Leaving an unknown directory
uk: %s: Залишаю нев╕домий каталог

source: %s: Entering directory `%s'
uk: %s: Вхожу у каталог "%s"

source: %s: Leaving directory `%s'
uk: %s: Залишаю каталог "%s"

source: %s[%u]: Entering an unknown directory
uk: %s[%u]: Вхожу у нев╕домий каталог

source: %s[%u]: Leaving an unknown directory
uk: %s[%u]: Залишаю нев╕домий каталог

source: %s[%u]: Entering directory `%s'
uk: %s[%u]: Вхожу у каталог "%s"

source: %s[%u]: Leaving directory `%s'
uk: %s[%u]: Залишаю каталог "%s"

source: . Stop.
uk: . Зупинка.

source: Unknown error %d
uk: Нев╕дома помилка %d

source: virtual memory exhausted
uk: в╕ртуальна пам'ять вичерпана

source: User access
uk: Доступ користувача

source: Reading makefile `%s'
uk: Читання make-файлу "%s"

source: (no default goal)
uk: (нема╓ мети за замовчуванням)

source: (search path)
uk: (шлях пошуку)

source: (don't care)
uk: (не зважати)

source: (no ~ expansion)
uk: (не розширювати ~)

source: invalid syntax in conditional
uk: нев╕рний синтаксис у умовному вираженн╕

source: extraneous `endef'
uk: зайвий "endef"

source: empty variable name
uk: порожн╓ ╕м'я зм╕нно╖

source: empty `override' directive
uk: порожня директива `override'

source: no file name for `%sinclude'
uk: не вказано ╕м'я файлу для "%sinclude"

source: commands commence before first target
uk: команди зустр╕нут╕ до першого визначення ц╕л╕

source: missing rule before commands
uk: перед командами пропущене правило

source: missing separator%s
uk: пропущений розд╕лювач%s

source: missing target pattern
uk: пропущений шаблон ц╕л╕

source: multiple target patterns
uk: не один шаблон ц╕л╕

source: target pattern contains no `%%'
uk: шаблон ц╕л╕ не м╕стить "%%"

source: missing `endif'
uk: пропущена "endif"

source: Extraneous text after `endef' directive
uk: Зайвий текст п╕сля директиви "endef"

source: missing `endef', unterminated `define'
uk: пропущена "endif", незавершена "define"

source: Extraneous text after `%s' directive
uk: Зайвий текст п╕сля директиви "%s"

source: extraneous `%s'
uk: зайва "%s"

source: only one `else' per conditional
uk: в умовному вираз╕ можлива лише одна директива `else'

source: mixed implicit and static pattern rules
uk: зм╕шан╕ неявн╕ правила ╕ правила з╕ статичними зразками

source: mixed implicit and normal rules
uk: зм╕шан╕ неявн╕ ╕ звичайн╕ правила

source: target `%s' doesn't match the target pattern
uk: ц╕ль "%s" не в╕дпов╕да╓ зразку ц╕лей

source: target file `%s' has both : and :: entries
uk: ц╕льовий файл "%s" ма╓ входження ╕ з ":", ╕ з "::"

source: target `%s' given more than once in the same rule.
uk: ц╕ль "%s" зазначена дек╕лька раз в одному правил╕

source: warning: overriding commands for target `%s'
uk: попередження: перекриття команд для ц╕л╕ "%s"

source: warning: ignoring old commands for target `%s'
uk: попередження: ╕гнорування старих команд для ц╕л╕ "%s"

source: warning: NUL character seen; rest of line ignored
uk: попередження: зустр╕нутий символ NUL; ╕гнору╓ться до к╕нця рядки

source: Nothing to be done for `%s'.
uk: Ц╕ль "%s" не вимага╓ виконання команд.

source: `%s' is up to date.
uk: "%s" не вимага╓ оновлення.

source: Considering target file `%s'.
uk: Обробка ц╕льового файлу "%s".

source: Recently tried and failed to update file `%s'.
uk: Попередня спроба оновити файл "%s" завершилася безусп╕шно.

source: File `%s' was considered already.
uk: Файл "%s" вже було оброблено.

source: Still updating file `%s'.
uk: Все ще оновлю╓ться файл "%s".

source: Finished updating file `%s'.
uk: Оновлення файлу "%s" завершено.

source: File `%s' does not exist.
uk: Файл "%s" не ╕сну╓.

source: Found an implicit rule for `%s'.
uk: Знайдено неявне правило для "%s".

source: No implicit rule found for `%s'.
uk: Не знайдено неявних правил для "%s".

source: Using default commands for `%s'.
uk: Використання команд по замовчуванню для "%s".

source: Circular %s <- %s dependency dropped.
uk: Цикл╕чна залежн╕сть %s <- %s пропущена.

source: The prerequisites of `%s' are being made.
uk: Ц╕л╕, в╕д яких залежить "%s", збираються.

source: Giving up on target file `%s'.
uk: Авар╕йний зупинка на ц╕льовому файл╕ "%s".

source: Target `%s' not remade because of errors.
uk: Ц╕ль "%s" не була перез╕брана через помилки.

source: Target `%s' is double-colon and has no prerequisites.
uk: Ц╕ль "%s" оголошена з двома двокрапками ╕ не ма╓ залежностей.

source: Must remake target `%s'.
uk: Необх╕дно перез╕брати ц╕ль "%s".

source: Commands of `%s' are being run.
uk: Команди для "%s" зараз виконуються.

source: Failed to remake target file `%s'.
uk: Спроба перез╕брати ц╕льовий файл "%s" безусп╕шна.

source: Successfully remade target file `%s'.
uk: Ц╕льовий файл "%s" усп╕шно перез╕браний.

source: Target file `%s' needs remade under -q.
uk: Ц╕льовий файл "%s" вимага╓ перезб╕рки з ключом -q.

source: %sNo rule to make target `%s'%s
uk: %sНема правила для створення ц╕л╕ "%s"%s

source: %sNo rule to make target `%s', needed by `%s'%s
uk: %sНема правила для створення ц╕л╕ "%s", необх╕дно╖ для "%s"%s

source: Warning: File `%s' has modification time in the future
uk: Увага: Файл "%s" ма╓ майбутн╕й час зм╕ни

source: Warning: File `%s' has modification time %.2g s in the future
uk: Увага: Файл "%s" ма╓ час зм╕ни %.2g с в майбутньому

source: # No implicit rules.
uk: # Неявних правил нема.

source: # %u implicit rules, %u
uk: # Неявних правил: %u, терм╕нальних: %u

source: BUG: num_pattern_rules wrong! %u != %u
uk: ПОМИЛКА: нев╕рне значення num_pattern_rules! %u != %u

source: unknown signal
uk: нев╕домий сигнал

source: Hangup
uk: Обрив

source: Interrupt
uk: Переривання

source: Quit
uk: Вих╕д

source: Illegal Instruction
uk: Неприпустима ╕нструкц╕я

source: Trace/breakpoint trap
uk: Пастка трасування чи точки зупинки

source: Aborted
uk: Припинено

source: IOT trap
uk: Пастка IOT

source: EMT trap
uk: Пастка EMT

source: Floating point exception
uk: Помилка операц╕╖ з крапкою, що плава╓

source: Killed
uk: Знищення

source: Bus error
uk: Помилка на шин╕

source: Segmentation fault
uk: Зб╕й сегментац╕╖

source: Bad system call
uk: Поганий системний виклик

source: Broken pipe
uk: Обрив каналу

source: Alarm clock
uk: Сигнал по таймеру

source: Terminated
uk: Завершено

source: User defined signal 1
uk: Обумовлений користувачем сигнал 1

source: User defined signal 2
uk: Обумовлений користувачем сигнал 2

source: Child exited
uk: Нащадок завершив роботу

source: Power failure
uk: Зб╕й живлення

source: Stopped
uk: Зупинено

source: Stopped (tty input)
uk: Зупинено (вв╕д з терм╕нала)

source: Stopped (tty output)
uk: Зупинено (вив╕д на терм╕нал)

source: Stopped (signal)
uk: Зупинено (сигнал)

source: CPU time limit exceeded
uk: Перевищене обмеження на процесорний час

source: File size limit exceeded
uk: Перевищений межа розм╕ру файлу

source: Virtual timer expired
uk: В╕ртуальний час минув

source: Profiling timer expired
uk: Час проф╕лювання минув

source: Window changed
uk: В╕кно зм╕нено

source: Continued
uk: Продовжено

source: Urgent I/O condition
uk: Умова екстреного вводу/виводу

source: I/O possible
uk: Можливий вв╕д/вив╕д

source: Resource lost
uk: Ресурс втрачено

source: Danger signal
uk: Сигнал небезпеки

source: Information request
uk: Запит ╕нформац╕╖

source: default
uk: по замовчуванню

source: environment
uk: визначена у середовищ╕

source: makefile
uk: файл make

source: environment under -e
uk: заданий ключ -e

source: command line
uk: визначена у командному рядку

source: `override' directive
uk: Директива `override'

source: automatic
uk: автоматична

source: (from `%s', line %lu)
uk: (з "%s", рядок %lu)

source: # Variables
uk: # Зм╕нн╕

source: # VPATH Search Paths
uk: # Шляхи пошуку VPATH

source: # No `vpath' search paths.
uk: # Не визначений шлях пошуку "vpath".

source: # %u `vpath' search paths.
uk: # %u "vpath" шляхи пошуку.

source: # No general (`VPATH' variable) search path.
uk: # Не визначений загальний (зм╕нна "VPATH") шлях пошуку.

source: # General (`VPATH' variable) search path: #
uk: # Загальний (зм╕нна "VPATH") шлях пошуку: #
